<a href="https://colab.research.google.com/github/NinaNikolova/data_mining/blob/main/pandas_ipynb_txt.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
s = pd.Series()
s

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  """Entry point for launching an IPython kernel.

Series([], dtype: float64)

In [ ]:
data = np.array(['a','b','c','d'])
s = pd.Series(data)
s

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
s

100    a
101    b
102    c
103    d
dtype: object

In [ ]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
s

a    0.0
b    1.0
c    2.0
dtype: float64

In [ ]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
s

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [ ]:
s = pd.Series(5, index=[0, 1, 2, 3])
s

0    5
1    5
2    5
3    5
dtype: int64

In [ ]:
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data,index=['b','c','d','a'])
print(s)
print(s[0])
print(s['c'])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64
1.0
2.0

In [ ]:
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[1,2,0,3])
print(s)
print(s[0])
print(s[:2])

1    a
2    b
0    c
3    d
dtype: object
c
1    a
2    b
dtype: object

In [ ]:
print('Data frames')

Data frames

In [ ]:
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)
print(df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [ ]:
print('Basic Funtionality')

Basic Funtionality

In [ ]:
df.axes

[RangeIndex(start=0, stop=3, step=1), Index(['Name', 'Age'], dtype='object')]

In [ ]:
df.dtypes

Name     object
Age     float64
dtype: object

In [ ]:
df.empty

False

In [ ]:
df.ndim

2

In [ ]:
df.size

6

In [ ]:
df.values

array([['Alex', 10.0],
       ['Bob', 12.0],
       ['Clarke', 13.0]], dtype=object)

In [ ]:
df.head(1)

   Name   Age
0  Alex  10.0

In [ ]:
df.tail(2)

     Name   Age
1     Bob  12.0
2  Clarke  13.0

In [ ]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres']),
     'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
     'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)

      Name  Age  Rating
0      Tom   25    4.23
1    James   26    3.24
2    Ricky   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    Smith   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [ ]:
print(df.sum())

Name      TomJamesRickyVinSteveSmithJackLeeDavidGasperBe...
Age                                                     382
Rating                                                44.92
dtype: object

In [ ]:
df['Age'].sum()

382

In [ ]:
for row_index,row in df.iterrows():
   print(row_index,row)

0 Name       Tom
Age         25
Rating    4.23
Name: 0, dtype: object
1 Name      James
Age          26
Rating     3.24
Name: 1, dtype: object
2 Name      Ricky
Age          25
Rating     3.98
Name: 2, dtype: object
3 Name       Vin
Age         23
Rating    2.56
Name: 3, dtype: object
4 Name      Steve
Age          30
Rating      3.2
Name: 4, dtype: object
5 Name      Smith
Age          29
Rating      4.6
Name: 5, dtype: object
6 Name      Jack
Age         23
Rating     3.8
Name: 6, dtype: object
7 Name       Lee
Age         34
Rating    3.78
Name: 7, dtype: object
8 Name      David
Age          40
Rating     2.98
Name: 8, dtype: object
9 Name      Gasper
Age           30
Rating       4.8
Name: 9, dtype: object
10 Name      Betina
Age           51
Rating       4.1
Name: 10, dtype: object
11 Name      Andres
Age           46
Rating      3.65
Name: 11, dtype: object

In [ ]:
sorted_df = df.sort_values(by=['Age', 'Rating'])

print(sorted_df)

      Name  Age  Rating
3      Vin   23    2.56
6     Jack   23    3.80
2    Ricky   25    3.98
0      Tom   25    4.23
1    James   26    3.24
5    Smith   29    4.60
4    Steve   30    3.20
9   Gasper   30    4.80
7      Lee   34    3.78
8    David   40    2.98
11  Andres   46    3.65
10  Betina   51    4.10

In [ ]:
df.loc[2:,['Name','Rating']]

      Name  Rating
2    Ricky    3.98
3      Vin    2.56
4    Steve    3.20
5    Smith    4.60
6     Jack    3.80
7      Lee    3.78
8    David    2.98
9   Gasper    4.80
10  Betina    4.10
11  Andres    3.65

In [ ]:
d = {'Name':pd.Series([None,'James',None,'Vin','Steve','Smith','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,None,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

In [ ]:
df.isnull()

     Name    Age  Rating
0    True  False   False
1   False  False   False
2    True  False   False
3   False   True   False
4   False  False   False
5   False  False   False
6   False  False   False
7   False  False   False
8   False  False   False
9   False  False   False
10  False  False   False
11  False  False   False

In [ ]:
df.fillna(0)

      Name   Age  Rating
0        0  25.0    4.23
1    James  26.0    3.24
2        0  25.0    3.98
3      Vin   0.0    2.56
4    Steve  30.0    3.20
5    Smith  29.0    4.60
6     Jack  23.0    3.80
7      Lee  34.0    3.78
8    David  40.0    2.98
9   Gasper  30.0    4.80
10  Betina  51.0    4.10
11  Andres  46.0    3.65

In [ ]:
df=pd.read_csv("temp.csv")
print(df)

   S.No    Name  Age       City  Salary
0     1     Tom   28    Toronto   20000
1     2     Lee   32   HongKong    3000
2     3  Steven   43   Bay Area    8300
3     4     Ram   38  Hyderabad    3900

In [ ]:
df=pd.read_csv("temp.csv",index_col=['S.No'])
print(df)

        Name  Age       City  Salary
S.No
1        Tom   28    Toronto   20000
2        Lee   32   HongKong    3000
3     Steven   43   Bay Area    8300
4        Ram   38  Hyderabad    3900

In [ ]:
df=pd.read_csv("temp.csv",index_col=['S.No'], dtype={'Salary': float})
print(df.dtypes)

Name       object
Age         int64
City       object
Salary    float64
dtype: object

In [ ]:
# Comparison to SQL: https://datascience.stackexchange.com/questions/34357/why-do-people-prefer-pandas-to-sql

### _Notes from the exercise:_

Create a Dataframe using Series with manually added index (_index=[**1**,**0**,2,3,4,5,6,7,8,9,10,**12**]_):

In [ ]:
#Create a Dictionary of series
s = pd.Series(['Tom','James','Ricky','Vin','Steve','Smith','Jack','Lee','David','Gasper','Betina','Andres'],
              index=[1,0,2,3,4,5,6,7,8,9,10,12])

d = {'Name':s,
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)
print(df)

      Name   Age  Rating
0    James  25.0    4.23
1      Tom  26.0    3.24
2    Ricky  25.0    3.98
3      Vin  23.0    2.56
4    Steve  30.0    3.20
5    Smith  29.0    4.60
6     Jack  23.0    3.80
7      Lee  34.0    3.78
8    David  40.0    2.98
9   Gasper  30.0    4.80
10  Betina  51.0    4.10
11     NaN  46.0    3.65
12  Andres   NaN     NaN

Iterating using [slice notation](https://stackoverflow.com/questions/509211/understanding-slice-notation) in Python:

In [ ]:
l = [0,1,2,3,4,5,6,7,8,9]

# even index
print(l[::2])

# odd index
print(l[1::2])

# every third index
print(l[2::3])

[0, 2, 4, 6, 8]
[1, 3, 5, 7, 9]
[2, 5, 8]